espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/app/wisun/component/network_measurement/sl_wisun_network_measurement_gui.c
/***************************************************************************//**
 * @file
 * @brief
 *******************************************************************************
 * # License
 * <b>Copyright 2021 Silicon Laboratories Inc. www.silabs.com</b>
 *******************************************************************************
 *
 * SPDX-License-Identifier: Zlib
 *
 * The licensor of this software is Silicon Laboratories Inc.
 *
 * This software is provided 'as-is', without any express or implied
 * warranty. In no event will the authors be held liable for any damages
 * arising from the use of this software.
 *
 * Permission is granted to anyone to use this software for any purpose,
 * including commercial applications, and to alter it and redistribute it
 * freely, subject to the following restrictions:
 *
 * 1. The origin of this software must not be misrepresented; you must not
 *    claim that you wrote the original software. If you use this software
 *    in a product, an acknowledgment in the product documentation would be
 *    appreciated but is not required.
 * 2. Altered source versions must be plainly marked as such, and must not be
 *    misrepresented as being the original software.
 * 3. This notice may not be removed or altered from any source distribution.
 *
 ******************************************************************************/

// -----------------------------------------------------------------------------
//                                   Includes
// -----------------------------------------------------------------------------

#include <stdio.h>
#include <string.h>
#include <inttypes.h>
#include <assert.h>
#include "sl_component_catalog.h"
#include "sl_wisun_util.h"
#include "sl_wisun_app_core.h"
#include "sl_wisun_app_setting.h"
#include "sl_wisun_network_measurement_gui.h"
#include "sl_wisun_network_measurement.h"
#include "sl_wisun_network_measurement_config.h"
#include "sl_display.h"
#include "sl_gui.h"
#include "socket.h"
#include "sl_wisun_ping.h"
#include "silabs_wisun_logo.h"

// -----------------------------------------------------------------------------
//                              Macros and Typedefs
// -----------------------------------------------------------------------------

/// Internal string buffer size
#define STR_BUFF_SIZE             (512U)

/// Max Packet count option size
#define MAX_PACKET_COUNT_OPTION   (7U)

/// Max Packet length option size
#define MAX_PACKET_LENGTH_OPTION  (8U)

/// Max Measurement type option size
#define MAX_MEAS_TYPE_OPTION      (3U)

/// Max regulatory domain count
#define MAX_REG_DOMAIN_COUNT      (16U)

/// Max networ size count
#define MAX_NETWORK_SIZE_COUNT    (6U)

/// Print Statistic format string
#define PRINT_FULL_STAT_FORMAT_STR \
  "[%s]\n\
Packets:       %u\n\
Packet length: %u\n\
Lost packets:  %u\n\
Packet loss:   %u%%\n\
Min. Time[ms]: %lu\n\
Max. Time[ms]: %lu\n\
Avg. Time[ms]: %lu\n\
lifetime:      %lu\n\
mac_tx_count:  %lu\n\
mac_tx_fail:   %lu\n\
mac_tx_ms_cnt: %lu\n\
mac_tx_ms_fail:%lu\n\
rpl_rank:      %u\n\
etx:           %u\n\
rsl_out:       %u\n\
rsl_in:        %u\n"

/// Print neighbor statistic format string
#define PRINT_NEIGHBOR_STAT_FORMAT_STR \
  "[%s]\n\
lifetime:      %lu\n\
mac_tx_count:  %lu\n\
mac_tx_fail:   %lu\n\
mac_tx_ms_cnt: %lu\n\
mac_tx_ms_fail:%lu\n\
rpl_rank:      %u\n\
etx:           %u\n\
rsl_out:       %u\n\
rsl_in:        %u\n"

/// Print ping statistic format string
#define PRINT_PING_STAT_FORMAT_STR \
  "[%s]\n\
Packets:       %u\n\
Packet length: %u\n\
Lost packets:  %u\n\
Packet loss:   %u%%\n\
Min. Time[ms]: %lu\n\
Max. Time[ms]: %lu\n\
Avg. Time[ms]: %lu\n"

/// Print Node Info format string
#define PRINT_NODE_INFO_FORMAT_STR \
  "Network Name:\n%s\n\
Nw. size: %s(%d)\n\
TX Power: %d\n\
Reg. domain: %s(%d)\n\
Op. class: %d\n\
Op. mode: 0x%x\n\
Global:\n[%s]\n\
Border Router:\n[%s]\n\
Primary Parent:\n[%s]\n\
Secondary Parent:\n[%s]\n\
TX budget: %lums\n%s\n"

/// Network Measurement settings structure
typedef struct sl_wisun_nwm_setting {
  /// Packet count
  uint16_t packet_count;
  /// Packet length
  uint16_t packet_length;
  /// Measurement type
  sl_wisun_nwm_target_type_t meas_type;
} sl_wisun_nwm_setting_t;

/// Node info structure type definition
typedef struct node_info {
  /// Addresses
  current_addr_t addresses;
  /// Settings
  app_setting_wisun_t settings;
} node_info_t;

// -----------------------------------------------------------------------------
//                          Static Function Declarations
// -----------------------------------------------------------------------------

/**************************************************************************//**
 * @brief Scroll optionlist and set selected
 * @details Callback function
 * @param[in] args Arguments
 *****************************************************************************/
static void _scroll_optionlist_and_set_select(void *args);

/**************************************************************************//**
 * @brief Scroll Text box
 * @details Callback function
 * @param[in] args Arguments
 *****************************************************************************/
static void _scroll_txt_box(void *args);

/**************************************************************************//**
 * @brief Node info form
 * @details Form renderer
 * @param[in] args Arguments
 *****************************************************************************/
static void _node_info_form(void *args);

/**************************************************************************//**
 * @brief Neighbor info form
 * @details Form renderer
 * @param[in] args Arguments
 *****************************************************************************/
static void _neighbors_info_form(void *args);

/**************************************************************************//**
 * @brief Settings form
 * @details Form renderer
 * @param[in] args Arguments
 *****************************************************************************/
static void _settings_form(void *args);

/**************************************************************************//**
 * @brief Packet count form
 * @details Form renderer
 * @param[in] args Arguments
 *****************************************************************************/
static void _packet_count_form(void *args);

/**************************************************************************//**
 * @brief Packet length form
 * @details Form renderer
 * @param[in] args Arguments
 *****************************************************************************/
static void _packet_length_form(void *args);

/**************************************************************************//**
 * @brief Measurement type form
 * @details Form renderer
 * @param[in] args Arguments
 *****************************************************************************/
static void _target_type_form(void *args);

/**************************************************************************//**
 * @brief Set packet count
 * @details Callback function
 * @param[in] args Arguments
 *****************************************************************************/
static void _set_packet_count(void *args);

/**************************************************************************//**
 * @brief Set packet length
 * @details Callback function
 * @param[in] args Arguments
 *****************************************************************************/
static void _set_packet_length(void *args);

/**************************************************************************//**
 * @brief Set measurement type
 * @details Callback function
 * @param[in] args Arguments
 *****************************************************************************/
static void _set_meas_type(void *args);

/**************************************************************************//**
 * @brief Measurement type to string converter
 * @details Helper function
 * @param meas_type
 * @return const char* String format of measurement type
 *****************************************************************************/
static const char * _meas_type_to_str(sl_wisun_nwm_target_type_t meas_type);

/**************************************************************************//**
 * @brief Add packet length option
 * @details Helper function
 * @param[in] opt Option item
 *****************************************************************************/
static inline void _add_packet_length_opt(const app_enum_t *opt);

/**************************************************************************//**
 * @brief Add packet count option
 * @details Helper function
 * @param[in] opt Option item
 *****************************************************************************/
static inline void _add_packet_count_opt(const app_enum_t *opt);

/**************************************************************************//**
 * @brief Add measurement type option
 * @details Helper function
 * @param[in] opt Option item
 *****************************************************************************/
static inline void _add_meas_type_opt(const app_enum_t *opt);

/**************************************************************************//**
 * @brief Start test form
 * @details Form renderer
 * @param[in] args Arguments
 *****************************************************************************/
static void _start_test_form(void *args);

/**************************************************************************//**
 * @brief Renderer test forrm
 * @details Helper function to execute in the display renderer thread
 *          instead of GUI event thread
 * @param[in] args Arguments
 *****************************************************************************/
static void _renderer_test_form(void *args);

/**************************************************************************//**
 * @brief Calculate packet loss percentage value
 * @details Helper function
 * @param[in] stat
 * @return uint8_t packet loss in % value
 *****************************************************************************/
static inline uint8_t _calc_packet_loss_percent(const sl_wisun_nwm_node_stat_t *stat);

/**************************************************************************//**
 * @brief Set reult textbox
 * @details Form renderer
 * @param[in] args Arguments
 *****************************************************************************/
static void _set_test_result_txtbox(void *args);

/**************************************************************************//**
 * @brief Set neighbor info textbox
 * @details Form renderer
 * @param[in] args Arguments
 *****************************************************************************/
static void _set_nbinfo_txtbox(void *args);

