espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/app/wisun/component/network_measurement/sl_wisun_network_measurement_gui.c
// -----------------------------------------------------------------------------
//                                Static Variables
// -----------------------------------------------------------------------------

/// String internal buffer allocation
static char _str_buff[STR_BUFF_SIZE] = { 0 };

/// Border Router temp statistic storage
static sl_wisun_nwm_node_stat_t _border_router_stat;

/// Primary Parent temp statistic storage
static sl_wisun_nwm_node_stat_t _primary_parent_stat;

/// Secondary Parent temp statistic storage
static sl_wisun_nwm_node_stat_t _secondary_parent_stat;

/// Children temp statistic storage
static sl_wisun_nwm_node_stat_t _children_stat[SL_WISUN_MAX_CHILDREN_COUNT];

/// Measurement setting allocation
static sl_wisun_nwm_setting_t _meas_settings = {
  .packet_count = SL_WISUN_NETWORK_MEASUREMENT_DEFAULT_PACKET_COUNT,
  .packet_length = SL_WISUN_NETWORK_MEASUREMENT_DEFAULT_PACKET_LENGTH,
  .meas_type = SL_WISUN_NWM_TARGET_TYPE_ALL
};

/// Packet count options
static const app_enum_t _packet_count_options[MAX_PACKET_COUNT_OPTION] = {
  { .value_str = "1", .value = 1U },
  { .value_str = "10", .value = 10U },
  { .value_str = "50", .value = 50U },
  { .value_str = "100", .value = 100U },
  { .value_str = "500", .value = 500U },
  { .value_str = "1000", .value = 1000U },
  { .value_str = "5000", .value = 5000U }
};

/// Packet length options
static const app_enum_t _packet_length_options[MAX_PACKET_LENGTH_OPTION] = {
  { .value_str = "9", .value = 9U }, // Minimum packet length by ping component
  { .value_str = "16", .value = 16U },
  { .value_str = "40", .value = 40U },
  { .value_str = "64", .value = 64U },
  { .value_str = "128", .value = 128U },
  { .value_str = "256", .value = 256U },
  { .value_str = "512", .value = 512U },
  { .value_str = "1024", .value = 1024U }
};

/// Measurement type options
static const app_enum_t _meas_type_options[MAX_MEAS_TYPE_OPTION] = {
  { .value_str = "BR/Parent/Children", .value = SL_WISUN_NWM_TARGET_TYPE_ALL },
  { .value_str = "Border Router", .value = SL_WISUN_NWM_TARGET_TYPE_BORDER_ROUTER },
  { .value_str = "Parent", .value = SL_WISUN_NWM_TARGET_TYPE_PARENT }
};

// -----------------------------------------------------------------------------
//                          Public Function Definitions
// -----------------------------------------------------------------------------

void sl_wisun_nwm_test_result_form(void *args)
{
  bool parent_available = false;
  uint8_t children_count = 0;
  (void) args;
  sl_gui_init_all_widget();

  sl_gui_title_set_label("Test result");
  sl_gui_title_update();

  sl_wisun_nwm_get_border_router_stat(&_border_router_stat);
  parent_available = sl_wisun_nwm_get_primary_parent_stat(&_primary_parent_stat);
  sl_wisun_nwm_get_children_stat(_children_stat,
                                 sizeof(_children_stat) / sizeof(sl_wisun_nwm_node_stat_t),
                                 &children_count);

  sl_gui_optionlist_add_item("Back to Main Menu", sl_wisun_nwm_main_form, NULL);
  // check whether BR meas is available
  if (_border_router_stat.name != NULL
      && strncmp(_border_router_stat.name, SL_WIDGET_EMPTY_STR, SL_WIDGET_MAX_LABEL_STR_LEN)) {
    sl_gui_optionlist_add_item(_border_router_stat.name,
                               _set_test_result_txtbox,
                               (void *)&_border_router_stat);
  }

  if (parent_available) {
    sl_gui_optionlist_add_item(_primary_parent_stat.name,
                               _set_test_result_txtbox,
                               (void *)&_primary_parent_stat);
  }

  if (children_count) {
    for (uint8_t i = 0; i < children_count; ++i) {
      sl_gui_optionlist_add_item(_children_stat[i].name,
                                 _set_test_result_txtbox,
                                 (void *)&_children_stat[i]);
    }
  }

  sl_gui_optionlist_assign_event_hnd_to_btn(SL_GUI_BUTTON0);
  sl_gui_optionlist_update();
  sl_gui_button_set_label(SL_GUI_BUTTON1, "Down");
  sl_gui_button_set_label(SL_GUI_BUTTON0, "Select");
  sl_gui_button_set_callback(SL_GUI_BUTTON1, _scroll_optionlist_and_set_select, NULL);
  sl_gui_button_update(SL_GUI_BUTTON0);
  sl_gui_button_update(SL_GUI_BUTTON1);

  sl_display_update();
}

void sl_wisun_nwm_logo_form(void *args)
{
  sl_wisun_nwm_logo_form_args_t *logo_form_args = (sl_wisun_nwm_logo_form_args_t *)args;
  static char buff[4U] = { 0 };

  sl_display_draw_bitmap(0, 0,
                         SILABS_WISUN_LOGO_WIDTH,
                         SILABS_WISUN_LOGO_HEIGHT,
                         silabs_wisun_logo_bits);
  sl_display_draw_string_on_line(logo_form_args->network_name, 2, GLIB_ALIGN_CENTER, 0, 0, false);
  sl_display_draw_string_on_line(logo_form_args->join_state_str, 10, GLIB_ALIGN_CENTER, 0, 0, false);
  snprintf(buff, 4U, "(%ld)", logo_form_args->join_state);
  sl_display_draw_string_on_line(buff, 11, GLIB_ALIGN_CENTER, 0, 0, false);
}

void sl_wisun_nwm_main_form(void *args)
{
  (void) args;
  sl_gui_init_all_widget();

  sl_gui_title_set_label("Network Measurement");
  sl_gui_title_update();
  sl_gui_optionlist_add_item("Node info", _node_info_form, NULL);
  sl_gui_optionlist_add_item("Start test", _renderer_test_form, NULL);
  sl_gui_optionlist_add_item("Test results", sl_wisun_nwm_test_result_form, NULL);
  sl_gui_optionlist_add_item("Neighbors info", _neighbors_info_form, NULL);
  sl_gui_optionlist_add_item("Settings", _settings_form, NULL);
  sl_gui_optionlist_assign_event_hnd_to_btn(SL_GUI_BUTTON0);
  sl_gui_optionlist_update();
  sl_gui_button_set_label(SL_GUI_BUTTON1, "Down");
  sl_gui_button_set_label(SL_GUI_BUTTON0, "Select");
  sl_gui_button_set_callback(SL_GUI_BUTTON1, _scroll_optionlist_and_set_select, NULL);
  sl_gui_button_update(SL_GUI_BUTTON0);
  sl_gui_button_update(SL_GUI_BUTTON1);
  sl_display_update();
}

// -----------------------------------------------------------------------------
//                          Static Function Definitions
// -----------------------------------------------------------------------------

