espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/app/wisun/component/network_measurement/sl_wisun_network_measurement_gui.c
static void _scroll_optionlist_and_set_select(void *args)
{
  (void) args;
  sl_gui_optionlist_scroll_down();
  sl_gui_optionlist_update();
  sl_gui_optionlist_assign_event_hnd_to_btn(SL_GUI_BUTTON0);
  sl_display_update();
}

static void _scroll_txt_box(void *args)
{
  (void) args;
  sl_gui_textbox_scroll_down();
  sl_gui_textbox_update();
  sl_display_update();
}

static void _node_info_form(void *args)
{
  node_info_t node_info = { 0 };
  (void) args;

  // Hold the remaning TX budget if applicable (regulation is active or value is valid)
  uint32_t tx_remaining_budget = 0UL;
  // Indicates if the remaining budget returned is a usable value.
  bool valid = false;

  sl_gui_title_set_label("Node Info");

  sl_gui_title_update();
  sl_gui_button_set_label(SL_GUI_BUTTON0, "Back");
  sl_gui_button_set_callback(SL_GUI_BUTTON0, sl_wisun_nwm_main_form, NULL);
  sl_gui_button_set_label(SL_GUI_BUTTON1, "Down");
  sl_gui_button_set_callback(SL_GUI_BUTTON1, _scroll_txt_box, NULL);

  sl_gui_button_update(SL_GUI_BUTTON1);
  sl_gui_button_update(SL_GUI_BUTTON0);

  // getting IP addresses
  app_wisun_get_current_addresses(&node_info.addresses);

  // getting settings
  app_wisun_setting_get(&node_info.settings);

  // get remanining transmission budget if applicable
  if ( app_wisun_get_regulation_active() == true ) {
    valid = app_wisun_get_remaining_tx_budget(&tx_remaining_budget);
  }

  snprintf(_str_buff, STR_BUFF_SIZE,
           PRINT_NODE_INFO_FORMAT_STR,
           node_info.settings.network_name,
           app_wisun_trace_util_nw_size_to_str(node_info.settings.network_size),
           node_info.settings.network_size,
           node_info.settings.tx_power,
           app_wisun_trace_util_reg_domain_to_str(node_info.settings.phy.regulatory_domain), node_info.settings.phy.regulatory_domain,
           node_info.settings.phy.operating_class,
           node_info.settings.phy.operating_mode,
           app_wisun_trace_util_get_ip_address_str(&node_info.addresses.global),
           app_wisun_trace_util_get_ip_address_str(&node_info.addresses.border_router),
           app_wisun_trace_util_get_ip_address_str(&node_info.addresses.primary_parent),
           app_wisun_trace_util_get_ip_address_str(&node_info.addresses.secondary_parent),
           (valid ? tx_remaining_budget : 0UL),
           (valid ? ((tx_remaining_budget == 0UL) ? "[Exceeded]" : "[Remaining]") : "[Not available]"));
  sl_gui_textbox_set(_str_buff);
  sl_gui_textbox_update();
  sl_display_update();
}

static void _renderer_test_form(void *args)
{
  (void) args;
  sl_display_renderer(_start_test_form, NULL, 0);
}

static void _start_test_form(void *args)
{
  (void) args;
  sl_wisun_nwm_quick_measure(_meas_settings.meas_type, _meas_settings.packet_count, _meas_settings.packet_length);
}

static void _settings_form(void *args)
{
  (void) args;
  sl_gui_init_all_widget();

  sl_gui_title_set_label("Settings");
  sl_gui_title_update();

  sl_gui_optionlist_add_item("Back to Main Menu", sl_wisun_nwm_main_form, NULL);
  sl_gui_optionlist_add_item("Packet count", _packet_count_form, NULL);
  sl_gui_optionlist_add_item("Packet length", _packet_length_form, NULL);
  sl_gui_optionlist_add_item("Target devices", _target_type_form, NULL);
  sl_gui_optionlist_assign_event_hnd_to_btn(SL_GUI_BUTTON0);
  sl_gui_optionlist_update();
  sl_gui_button_set_label(SL_GUI_BUTTON1, "Down");
  sl_gui_button_set_label(SL_GUI_BUTTON0, "Select");
  sl_gui_button_set_callback(SL_GUI_BUTTON1, _scroll_optionlist_and_set_select, NULL);
  sl_gui_button_update(SL_GUI_BUTTON0);
  sl_gui_button_update(SL_GUI_BUTTON1);

  sl_display_update();
}

static void _set_packet_count(void *args)
{
  app_enum_t *val = (void *) args;
  _meas_settings.packet_count = val->value;
  sl_display_renderer(_settings_form, NULL, 0);
}

static void _set_meas_type(void *args)
{
  app_enum_t *val = (void *) args;
  _meas_settings.meas_type = (sl_wisun_nwm_target_type_t) val->value;
  sl_display_renderer(_settings_form, NULL, 0);
}

static void _set_packet_length(void *args)
{
  app_enum_t *val = (void *) args;
  _meas_settings.packet_length = val->value;
  sl_display_renderer(_settings_form, NULL, 0);
}

static void _packet_count_form(void *args)
{
  (void) args;
  sl_gui_init_all_widget();

  snprintf(_str_buff, STR_BUFF_SIZE, "Packet cnt: %d", _meas_settings.packet_count);
  sl_gui_title_set_label(_str_buff);
  sl_gui_title_update();

  sl_gui_optionlist_add_item("Back to Settings", _settings_form, NULL);

  for (uint32_t i = 0; i < MAX_PACKET_COUNT_OPTION; ++i) {
    _add_packet_count_opt(&_packet_count_options[i]);
  }
  sl_gui_optionlist_assign_event_hnd_to_btn(SL_GUI_BUTTON0);
  sl_gui_optionlist_update();
  sl_gui_button_set_label(SL_GUI_BUTTON1, "Down");
  sl_gui_button_set_label(SL_GUI_BUTTON0, "Select");
  sl_gui_button_set_callback(SL_GUI_BUTTON1, _scroll_optionlist_and_set_select, NULL);
  sl_gui_button_update(SL_GUI_BUTTON0);
  sl_gui_button_update(SL_GUI_BUTTON1);

  sl_display_update();
}

static inline void _add_packet_count_opt(const app_enum_t *opt)
{
  sl_gui_optionlist_add_item(opt->value_str, _set_packet_count, (void *)opt);
}

static inline void _add_meas_type_opt(const app_enum_t *opt)
{
  sl_gui_optionlist_add_item(opt->value_str, _set_meas_type, (void *)opt);
}

static inline void _add_packet_length_opt(const app_enum_t *opt)
{
  if (opt->value < SL_WISUN_PING_MAX_PACKET_LENGTH) {
    sl_gui_optionlist_add_item(opt->value_str, _set_packet_length, (void *)opt);
  }
}

static void _packet_length_form(void *args)
{
  (void) args;
  sl_gui_init_all_widget();

  snprintf(_str_buff, STR_BUFF_SIZE, "Packet len: %d", _meas_settings.packet_length);
  sl_gui_title_set_label(_str_buff);
  sl_gui_title_update();

  sl_gui_optionlist_add_item("Back to Settings", _settings_form, NULL);

  for (uint32_t i = 0; i < MAX_PACKET_LENGTH_OPTION; ++i) {
    _add_packet_length_opt(&_packet_length_options[i]);
  }

  sl_gui_optionlist_assign_event_hnd_to_btn(SL_GUI_BUTTON0);
  sl_gui_optionlist_update();
  sl_gui_button_set_label(SL_GUI_BUTTON1, "Down");
  sl_gui_button_set_label(SL_GUI_BUTTON0, "Select");
  sl_gui_button_set_callback(SL_GUI_BUTTON1, _scroll_optionlist_and_set_select, NULL);
  sl_gui_button_update(SL_GUI_BUTTON0);
  sl_gui_button_update(SL_GUI_BUTTON1);

  sl_display_update();
}

