espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/app/wisun/component/network_measurement/sl_wisun_network_measurement_gui.c
static const char * _meas_type_to_str(sl_wisun_nwm_target_type_t meas_type)
{
  for (uint8_t i = 0; i < MAX_MEAS_TYPE_OPTION; ++i) {
    if (_meas_type_options[i].value == meas_type) {
      return _meas_type_options[i].value_str;
    }
  }
  return "Undefined";
}

static void _target_type_form(void *args)
{
  (void) args;
  sl_gui_init_all_widget();

  snprintf(_str_buff, STR_BUFF_SIZE, "%s",
           _meas_type_to_str(_meas_settings.meas_type));
  sl_gui_title_set_label(_str_buff);
  sl_gui_title_update();

  sl_gui_optionlist_add_item("Back to Settings", _settings_form, NULL);

  for (uint32_t i = 0; i < MAX_MEAS_TYPE_OPTION; ++i) {
    _add_meas_type_opt(&_meas_type_options[i]);
  }

  sl_gui_optionlist_assign_event_hnd_to_btn(SL_GUI_BUTTON0);
  sl_gui_optionlist_update();
  sl_gui_button_set_label(SL_GUI_BUTTON1, "Down");
  sl_gui_button_set_label(SL_GUI_BUTTON0, "Select");
  sl_gui_button_set_callback(SL_GUI_BUTTON1, _scroll_optionlist_and_set_select, NULL);
  sl_gui_button_update(SL_GUI_BUTTON0);
  sl_gui_button_update(SL_GUI_BUTTON1);

  sl_display_update();
}
static inline uint8_t _calc_packet_loss_percent(const sl_wisun_nwm_node_stat_t *stat)
{
  return stat->ping_stat.packet_count ? (stat->ping_stat.lost * 100) / stat->ping_stat.packet_count : 0xFF;
}

static void _set_test_result_txtbox(void *args)
{
  sl_wisun_nwm_node_stat_t *stat = (sl_wisun_nwm_node_stat_t *) args;
  sl_gui_title_set_label(stat->name);
  sl_gui_title_update();

  sl_gui_textbox_init();
  if (stat->type == SL_WISUN_NWM_NODE_TYPE_BORDER_ROUTER) {
    snprintf(_str_buff, STR_BUFF_SIZE, PRINT_PING_STAT_FORMAT_STR,
             app_wisun_trace_util_get_ip_address_str(&stat->addr.sin6_addr),
             stat->ping_stat.packet_count,
             stat->ping_stat.packet_length,
             stat->ping_stat.lost,
             _calc_packet_loss_percent(stat),
             stat->ping_stat.min_time_ms,
             stat->ping_stat.max_time_ms,
             stat->ping_stat.avg_time_ms);
  } else {
    snprintf(_str_buff, STR_BUFF_SIZE, PRINT_FULL_STAT_FORMAT_STR,
             app_wisun_trace_util_get_ip_address_str(&stat->addr.sin6_addr),
             stat->ping_stat.packet_count,
             stat->ping_stat.packet_length,
             stat->ping_stat.lost,
             _calc_packet_loss_percent(stat),
             stat->ping_stat.min_time_ms,
             stat->ping_stat.max_time_ms,
             stat->ping_stat.avg_time_ms,
             stat->stat.lifetime,
             stat->stat.mac_tx_count,
             stat->stat.mac_tx_failed_count,
             stat->stat.mac_tx_ms_count,
             stat->stat.mac_tx_ms_failed_count,
             stat->stat.rpl_rank,
             stat->stat.etx,
             stat->stat.rsl_out,
             stat->stat.rsl_in);
  }

  sl_gui_textbox_set(_str_buff);
  sl_gui_textbox_update();

  sl_gui_button_set_label(SL_GUI_BUTTON0, "Back");
  sl_gui_button_set_callback(SL_GUI_BUTTON0, sl_wisun_nwm_test_result_form, NULL);
  sl_gui_button_set_label(SL_GUI_BUTTON1, "Down");
  sl_gui_button_set_callback(SL_GUI_BUTTON1, _scroll_txt_box, NULL);

  sl_gui_button_update(SL_GUI_BUTTON1);
  sl_gui_button_update(SL_GUI_BUTTON0);

  sl_display_update();
}

static void _set_nbinfo_txtbox(void *args)
{
  sl_wisun_nwm_node_stat_t *stat = (sl_wisun_nwm_node_stat_t *) args;
  sl_gui_title_set_label(stat->name);
  sl_gui_title_update();

  sl_gui_textbox_init();

  snprintf(_str_buff, STR_BUFF_SIZE, PRINT_NEIGHBOR_STAT_FORMAT_STR,
           app_wisun_trace_util_get_ip_address_str(&stat->addr.sin6_addr),
           stat->stat.lifetime,
           stat->stat.mac_tx_count,
           stat->stat.mac_tx_failed_count,
           stat->stat.mac_tx_ms_count,
           stat->stat.mac_tx_ms_failed_count,
           stat->stat.rpl_rank,
           stat->stat.etx,
           stat->stat.rsl_out,
           stat->stat.rsl_in);

  sl_gui_textbox_set(_str_buff);
  sl_gui_textbox_update();

  sl_gui_button_set_label(SL_GUI_BUTTON0, "Back");
  sl_gui_button_set_callback(SL_GUI_BUTTON0, _neighbors_info_form, NULL);
  sl_gui_button_set_label(SL_GUI_BUTTON1, "Down");
  sl_gui_button_set_callback(SL_GUI_BUTTON1, _scroll_txt_box, NULL);

  sl_gui_button_update(SL_GUI_BUTTON1);
  sl_gui_button_update(SL_GUI_BUTTON0);

  sl_display_update();
}

static void _neighbors_info_form(void *args)
{
  bool parent_available = false;
  uint8_t children_count = 0;

  (void) args;
  sl_gui_init_all_widget();

  sl_gui_title_set_label("Neighbors Info");
  sl_gui_title_update();

  sl_wisun_nwm_get_nodes(NULL, 0);

  parent_available = sl_wisun_nwm_get_primary_parent_stat(&_primary_parent_stat);
  sl_wisun_nwm_get_children_stat(_children_stat,
                                 sizeof(_children_stat) / sizeof(sl_wisun_nwm_node_stat_t),
                                 &children_count);

  sl_gui_optionlist_add_item("Back to Main Menu", sl_wisun_nwm_main_form, NULL);

  if (parent_available) {
    sl_gui_optionlist_add_item("Primary Parent",
                               _set_nbinfo_txtbox,
                               (void *)&_primary_parent_stat);
  }

  parent_available = sl_wisun_nwm_get_secondary_parent_stat(&_secondary_parent_stat);

  if (parent_available) {
    sl_gui_optionlist_add_item("Secondary Parent",
                               _set_nbinfo_txtbox,
                               (void *)&_secondary_parent_stat);
  }

  if (children_count) {
    for (uint8_t i = 0; i < children_count; ++i) {
      sl_gui_optionlist_add_item(_children_stat[i].name,
                                 _set_nbinfo_txtbox,
                                 (void *)&_children_stat[i]);
    }
  }

  sl_gui_optionlist_assign_event_hnd_to_btn(SL_GUI_BUTTON0);
  sl_gui_optionlist_update();
  sl_gui_button_set_label(SL_GUI_BUTTON1, "Down");
  sl_gui_button_set_label(SL_GUI_BUTTON0, "Select");
  sl_gui_button_set_callback(SL_GUI_BUTTON1, _scroll_optionlist_and_set_select, NULL);
  sl_gui_button_update(SL_GUI_BUTTON0);
  sl_gui_button_update(SL_GUI_BUTTON1);

  sl_display_update();
}
